//
//  ViewController.swift
//  Inch Anle hima ?
//
//  Created by Rafik on 19.07.22.
//

import UIKit

class ViewController: UIViewController {
    
    @IBOutlet weak var harcer: UITextView!
    
    let harcTxanerin = ["Որո՞նք են երեք բաները, որոնցով ամենից շատ հպարտ եք:","Ի՞նչ մանկական բան եք դեռ հաճույքով անում:","Ո՞րն է երբևէ արած ամենասարսափելին:","Ինչպիսի՞ թաքնված տաղանդներ ունեք:","Ո՞րն է մի բանը, որի համար երախտապարտ եք ձեր կյանքում:","Կարո՞ղ եք մեզ ասել մի բան, որը երբևէ մեկին չեք ասել:","Ի՞նչ եք հոգնել իրականում լսելուց:","Ո՞րն է ամենահիմար բանը, որ երբևէ չեք արել, բայց կցանկանաք:","Եթե կարողանաք վերաշարադրել ձեր անցյալը, ի՞նչը կփոխեիք դրա հետ կապված:","Ո՞րն է ամենամեծ կասկածը:","Ո՞րն է մի բանը, որով դուք կրքոտ եք:","Ի՞նչ ես արել, որ աշխարհն ավելի լավ տեղ դառնա:","Ո՞րն է երբևէ կայացրած ամենախենթ, իմպուլսիվ որոշումը, որի համար երբեք չես փոշմանել:","Եթե շուն լինեիք, ո՞ր ցեղը կլինեիք:","Ի՞նչ կասեր ձեր նախկին ընկերուհին հենց հիմա ձեր մասին:","Երբևէ որևէ բան գողացե՞լ եք, և եթե այո, ապա ի՞նչ է դա:"]
    
    
    @IBOutlet weak var letsStart: UILabel!
    
    
    @IBOutlet weak var label: UILabel!
    
  
    let harcAxjiknerin = ["Որո՞նք են երեք ամենակարևոր հատկությունները,որոնք դուք փնտրում եք տղամարդու մեջ","Ո՞րն է ձեր երազած աշխատանքը","Որտե՞ղ կլինեիք ամենաերջանիկ ապրելը `քաղաքում, ագարակում կամ այլ վայրում, և ինչու:","Հավատու՞մ եք հրաշքների:","Որո՞նք են այն երեք հարցերը, որոնք կցանկանայիք նրան տալ:"," Ո՞րն է ամենախենթ բանը, որի մասին երբևէ երազել եք:","Ի՞նչն է ձեզ համար ավելի կարևոր ՝ փող աշխատել կամ երջանկություն հետապնդել","Ո՞րն է ձեր կարգախոսը կյանքում և ապրում եք դրանով:","Որո՞նք են ձեր կյանքի որոշ իրադարձություններ, որոնք կցանկանայիք վերապրել:","Նախընտրո՞ւմ եք լավ գրկելը կամ լավ համբույրը:","Ո՞րն է ձեզ երբևէ տրված ամենադժվար ճշմարտությունը կամ համարձակ հարցը:","Ե՞րբ եք առաջին անգամ սեռական հարաբերություն ունեցել և արդյո՞ք այն է եղել, ինչ ակնկալում եք:","Երբևէ համբուրե՞լ եք ձեր լավագույն ընկերոջը, և եթե այո, ապա ինչպե՞ս է դա ձեզ զգացել:","Անձնական հարցերը ձեզ նյարդայնացնու՞մ են:","Դուք հիմա սիրահարվա՞ծ եք:"]
    
    override func viewDidLoad() {
        
        super.viewDidLoad()
        // Do any additional setup after loading the view.
    }
    
    @IBAction func Սկիզբ(_ sender: Any) {
        
        letsStart.text = "Սկսե՞նք"
   
        harcer.text = "Պատրա՞ստ ես անկեղծանալ\n     Սկսե՞նք "
    }
    
    
    @IBAction func Start(_ sender: UIButton) {
        
        letsStart.text = nil
        
     
        let index = Int(arc4random_uniform(UInt32(harcAxjiknerin.count)))
            let result = harcAxjiknerin[index]
      
        harcer.text = result
    
    }
    
    @IBAction func Stop(_ sender: UIButton) {
        
        letsStart.text = nil
        let index1 =  Int(arc4random_uniform(UInt32(harcTxanerin.count)))
        let result1 = harcTxanerin[index1]
       
       harcer.text = result1
     
    }
}

